/*
 * Задача 3: «Развернуть слова в предложении»
 *
 * Напишите функцию reverseWords(str), принимающую на вход строку.
 * Функция должна вернуть новую строку, расставив слова в обратном
 * порядке.Если в строке есть знаки препинания, их можно удалить
 * или оставить — на ваше усмотрение.
 *
 */

function reverseWords(str) {
  let str1 = "";
  let world = "";

  for (let char of str) {
    if (char != " ") {
      world += char;
    } else {
      str1 = world + " " + str1;
      world = "";
    }
  }

  str1 = world + " " + str1;
  str1 = str1.slice(0, str1.length - 1);

  return str1;
}

// Протестируйте решение, вызывая функцию с разными аргументами:

console.log(reverseWords("всегда много путей достичь цель есть")); // "есть цель достичь путей много всегда"
console.log(reverseWords("испробовать их все должны вы")); // "вы должны все их испробовать"
